{
    "about": "About ",
    "me": "Me",
    "projects": "Projects",
    "contacts": "Contacts",
    "welcome": "Welcome",
    "hello": "Hello world! I'm Nursultan, a Mobile App Developer.",
    "about_me": "I'm a passionate Flutter developer with over 3.5 years of experience building cross-platform mobile apps. I enjoy solving complex problems, writing clean code, and crafting smooth user experiences.",
    "social_contacts": "Social Contacts",
    "professional": "Professional",
    "experience": "Experience",
    "august": "August",
    "february": "February",
    "my": "My ",
    "skills": "Skills",
    "flutterDeveloper": "Flutter Developer",
    "experiencePeriodOdigital": "February 2022 – June 2025",
    "june2023": "Jun 2023",
    "workAtOdigital": "Worked as a Flutter Developer at Odigital, responsible for full-cycle development of cross-platform mobile apps for Android and iOS. Took part in architecture design, feature development, UI implementation, and deployment. Also temporarily served as a team lead on select projects.",
    "workAtFreelancing": "Worked as a Freelance Flutter Developer, delivering complete cross-platform mobile applications for clients in e-commerce, services, and task management. Responsible for full-cycle development: UI/UX implementation, business logic, REST API integration, and deployment. All projects were built independently, including direct communication with clients and product planning.",
    "iWorkedOn": "I worked on",
    "hard": "Hard",
    "topDescription": "Football platform for the CIS region. Built full user flow: registration, team creation, match scheduling, field booking, chat, and tournament participation. Implemented both UI and business logic for core features.",
    "akemgekDescription": "Job search platform for Kyrgyzstan and Europe. Created vacancy browsing, filters by region and category, CV submission, employer interface, and role-based navigation.",
    "oshOnlineDescription": "Local mobile app for classifieds, organization directory, and city news in Osh. Maintained and updated the app post-release: fixed UI/UX bugs, improved stability, and published several updates to Google Play and App Store. Worked on legacy code and contributed to the overall user experience improvement.",
    "eserviceDescription": "E-commerce app for electronics and accessories. Developed product catalog, filtering, search, cart, checkout, and user account sections. Focused on clean architecture and responsive UI.",
    "jalalAbadOnlineDescription": "Mobile app for classified ads, organization directory, and local news in the city of Jalal-Abad. Provided ongoing maintenance, fixed UI and functional bugs, and prepared updates for Google Play and App Store releases. Ensured app stability and worked on refining the existing user experience.",
    "karaBaltaOnlineDescription": "Local app for classifieds, business directory, and city news in Kara-Balta. Maintained and improved the existing codebase by fixing bugs and handling releases on Google Play and App Store. Contributed to app stability and UI consistency across platforms.",
    "willexCargoDescription": "A mobile app for parcel delivery from China to Kyrgyzstan. Built from scratch, the app provides shipment tracking, delivery status updates, and customer account features. Designed and implemented the entire UI in Flutter and contributed to the business logic, including barcode scanning, notifications, and order management. Focused on performance, usability, and seamless user flow.",
    "sapatCargoDescription": "Cargo delivery app for shipments from Bishkek to cities across Russia. Developed from scratch: implemented UI in Flutter, built cargo tracking features, order creation flow, and delivery status updates. Integrated push notifications and designed a clean user experience for managing shipments.",
    "manasLogisDescription": "A logistics app for international cargo delivery from South Korea to Central Asia. Developed from scratch: implemented shipment tracking, delivery timelines, and user notifications. Built the full UI in Flutter, integrated REST APIs for cargo data, and added real-time status updates. Focused on usability and transparency for end-users.",
    "tauraExpressDescription": "A logistics mobile app for tracking cargo deliveries from China to Kyrgyzstan. Built from scratch: implemented UI in Flutter, added real-time delivery status, cargo tracking, and arrival notifications. Developed core features such as order overview, parcel timeline, and user-friendly interfaces for over 3,000 active clients. Focused on stability, speed, and simple UX for end-users.",
    "opopDescription": "An e-commerce platform for wholesale trade across the CIS region. Built the complete UI from scratch using Flutter: implemented responsive layouts, product catalog views, marketplace pages, and mobile-friendly components. Focused on clean design, scalability, and cross-device compatibility.",
    "yldamCargoDescription": "Parcel delivery app for fast shipments from China to Kyrgyzstan. Independently developed the application using Flutter: implemented real-time parcel tracking, delivery cost calculator, shipment status notifications, and support chat. Focused on speed, reliability, and user-friendly flow from order to delivery.",
    "appkelDescription": "Grocery delivery app for customers. Built an intuitive mobile interface using Flutter to browse products, manage cart, place orders, track delivery status, and onboard new users. Focused on fast ordering experience and clean UI for daily use.",
    "appkelSatDescription": "Companion app for delivery personnel. Developed with Flutter: included role-based login, active order list, order detail view, and delivery status updates. Designed for simplicity and real-time communication with the main system.",
    "chelnokSatDescription": "A niche B2B marketplace app for the sewing and textile industry. Built the entire Flutter app from scratch as a solo project. Implemented features such as product/service listings, custom order creation, service provider search, and category-based filtering. Focused on intuitive UI and smooth user flow for tailors, suppliers, and workshop owners.",
    "toDoDescription": "A task management app focused on simplicity and execution flow. Designed and developed from scratch using Flutter. Implemented user authentication, task creation, editing, deletion, task timeline, and dashboard. Built intuitive UI and smooth navigation to streamline personal productivity.",
    "last": "Last "
}