{
    "about": "О ",
    "me": "Себе",
    "projects": "Проекты",
    "contacts": "Контакты",
    "welcome": "Добро пожаловать",
    "hello": "Привет! Я — Нурсултан, мобильный разработчик.",
    "about_me": "Flutter-разработчик с более чем 3.5 годами практического опыта. Создаю кроссплатформенные приложения от идеи до релиза. Люблю чистый код, продуманный интерфейс и нестандартные задачи.",
    "social_contacts": "Социальные контакты",
    "professional": "Профессиональный",
    "experience": "Опыт",
    "august": "Август",
    "february": "Февраль",
    "my": "Мои ",
    "skills": "Навыки",
    "flutterDeveloper": "Flutter-разработчик",
    "experiencePeriodOdigital": "Февраль 2022 – Июнь 2025",
    "june2023": "Июн 2023",
    "workAtOdigital": "Работал Flutter-разработчиком в компании Odigital. Отвечал за полный цикл разработки кроссплатформенных мобильных приложений для Android и iOS: от проектирования архитектуры и реализации функционала до развёртывания и поддержки. В некоторых проектах временно выполнял обязанности тимлида.",
    "workAtFreelancing": "Занимался фриланс-разработкой кроссплатформенных мобильных приложений в сферах электронной коммерции, сервисов и планирования задач. Отвечал за полный цикл разработки: UI/UX, бизнес-логика, интеграция REST API и публикация. Все проекты выполнялись полностью самостоятельно, включая общение с клиентами и планирование функционала.",
    "iWorkedOn": ", над которыми я работал",
    "hard": "Технические",
    "topDescription": "Футбольная платформа для стран СНГ. Разработал полный пользовательский поток: регистрация, создание команд, планирование матчей, бронирование полей, чат внутри приложения и участие в турнирах. Отвечал за реализацию как пользовательского интерфейса, так и бизнес-логики основных функций.",
    "akemgekDescription": "Платформа для поиска работы в Кыргызстане и Европе. Реализовал просмотр вакансий, фильтрацию по регионам и категориям, отправку резюме, интерфейс для работодателей и навигацию по ролям.",
    "oshOnlineDescription": "Мобильное приложение для размещения объявлений, справочника организаций и новостей города Ош. Занимался поддержкой проекта: исправлял ошибки, улучшал стабильность и участвовал в релизах обновлений в Google Play и App Store. Работал с уже существующим кодом и внёс вклад в улучшение пользовательского опыта.",
    "eserviceDescription": "e-commerce приложение для продажи электроники. Разработал каталог товаров, фильтрацию, поиск, корзину, оформление заказов и личный кабинет. Соблюдал принципы чистой архитектуры и адаптивного дизайна.",
    "jalalAbadOnlineDescription": "Мобильное приложение для объявлений, справочника организаций и новостей города Джалал-Абад. Занимался технической поддержкой проекта: исправлял баги, улучшал интерфейс и участвовал в релизах на Google Play и App Store. Работал над улучшением стабильности и удобства использования приложения.",
    "karaBaltaOnlineDescription": "Мобильное приложение для объявлений, справочника и новостей города Кара-Балта. Занимался поддержкой проекта: исправлял баги, обновлял интерфейс и публиковал обновления в Google Play и App Store. Работал над улучшением стабильности и удобства использования.",
    "willexCargoDescription": "Мобильное приложение для доставки посылок из Китая в Кыргызстан. Разрабатывал проект с нуля: реализовал интерфейс на Flutter, участвовал в построении бизнес-логики, включая трекинг посылок, сканирование штрих-кодов, уведомления и управление заказами. Особое внимание уделялось стабильности, удобству и скорости работы приложения.",
    "sapatCargoDescription": "Приложение для доставки грузов из Бишкека по всей России. Разработал с нуля: реализовал интерфейс на Flutter, добавил трекинг груза, создание заказов, обновление статуса доставки и пуш-уведомления. Сфокусировался на простом и понятном пользовательском опыте.",
    "manasLogisDescription": "Приложение для доставки грузов из Южной Кореи в страны Центральной Азии. Разработал с нуля: реализовал трекинг посылок, отображение сроков доставки, уведомления, интерфейс во Flutter и интеграцию с API для отображения статуса в реальном времени. Сфокусировался на прозрачности и удобстве для пользователя.",
    "tauraExpressDescription": "Мобильное приложение для отслеживания доставки грузов из Китая в Кыргызстан. Разработал с нуля: реализовал интерфейс на Flutter, добавил отображение статуса доставки в реальном времени, уведомления и таймлайн посылок. Построил основные модули: просмотр заказов, трекинг, удобная навигация. Приложение используется более чем 3 000 активными клиентами по всей стране.",
    "opopDescription": "Платформа электронной торговли для оптовой продажи товаров по всему СНГ. Отвечал за вёрстку: реализовал адаптивный интерфейс во Flutter, страницы маркетплейса, каталог товаров и базовые элементы интерфейса. Уделял внимание чистоте дизайна и мобильной оптимизации.",
    "last": "Последние "
}